tutorials/multiphase/interDyMFoam/ras/floatingObject/0.org/k
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    stationaryWalls
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }
    floatingObject
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0.1;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
